GopalSaraf/Practicals/PSDL/include/proc/pic16f19185.inc
#define ANSF4                            BANKMASK(ANSELF), 4
#define ANSF5                            BANKMASK(ANSELF), 5
#define ANSF6                            BANKMASK(ANSELF), 6
#define ANSF7                            BANKMASK(ANSELF), 7
#define ARPT0                            BANKMASK(ALRMRPT), 0
#define ARPT1                            BANKMASK(ALRMRPT), 1
#define ARPT2                            BANKMASK(ALRMRPT), 2
#define ARPT3                            BANKMASK(ALRMRPT), 3
#define ARPT4                            BANKMASK(ALRMRPT), 4
#define ARPT5                            BANKMASK(ALRMRPT), 5
#define ARPT6                            BANKMASK(ALRMRPT), 6
#define ARPT7                            BANKMASK(ALRMRPT), 7
#define AS                               BANKMASK(SMT1STAT), 0
#define AS0E                             BANKMASK(CWG1AS1), 0
#define AS1E                             BANKMASK(CWG1AS1), 1
#define AS2E                             BANKMASK(CWG1AS1), 2
#define AS3E                             BANKMASK(CWG1AS1), 3
#define AS4E                             BANKMASK(CWG1AS1), 4
#define BCL1IE                           BANKMASK(PIE3), 1
#define BCL1IF                           BANKMASK(PIR3), 1
#define BF                               BANKMASK(SSP1STAT), 0
#define BF1                              BANKMASK(SSP1STAT), 0
#define BIAS0                            BANKMASK(LCDVCON1), 0
#define BIAS1                            BANKMASK(LCDVCON1), 1
#define BIAS2                            BANKMASK(LCDVCON1), 2
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORRDY                           BANKMASK(BORCON), 0
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BSR5                             BANKMASK(BSR), 5
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 0
#define C1IF                             BANKMASK(PIR2), 0
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NSEL), 0
#define C1NCH1                           BANKMASK(CM1NSEL), 1
#define C1NCH2                           BANKMASK(CM1NSEL), 2
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1PCH0                           BANKMASK(CM1PSEL), 0
#define C1PCH1                           BANKMASK(CM1PSEL), 1
#define C1PCH2                           BANKMASK(CM1PSEL), 2
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 1
#define C2IF                             BANKMASK(PIR2), 1
#define C2INTN                           BANKMASK(CM2CON1), 0
#define C2INTP                           BANKMASK(CM2CON1), 1
#define C2NCH0                           BANKMASK(CM2NSEL), 0
#define C2NCH1                           BANKMASK(CM2NSEL), 1
#define C2NCH2                           BANKMASK(CM2NSEL), 2
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2PCH0                           BANKMASK(CM2PSEL), 0
#define C2PCH1                           BANKMASK(CM2PSEL), 1
#define C2PCH2                           BANKMASK(CM2PSEL), 2
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3
#define C3TSEL0                          BANKMASK(CCPTMRS0), 4
#define C3TSEL1                          BANKMASK(CCPTMRS0), 5
#define C4TSEL0                          BANKMASK(CCPTMRS0), 6
#define C4TSEL1                          BANKMASK(CCPTMRS0), 7
#define CAL0                             BANKMASK(RTCCAL), 0
#define CAL01                            BANKMASK(TMR1L), 0
#define CAL1                             BANKMASK(RTCCAL), 1
#define CAL11                            BANKMASK(TMR1L), 1
#define CAL2                             BANKMASK(RTCCAL), 2
#define CAL21                            BANKMASK(TMR1L), 2
#define CAL3                             BANKMASK(RTCCAL), 3
#define CAL31                            BANKMASK(TMR1L), 3
#define CAL4                             BANKMASK(RTCCAL), 4
#define CAL41                            BANKMASK(TMR1L), 4
#define CAL5                             BANKMASK(RTCCAL), 5
#define CAL51                            BANKMASK(TMR1L), 5
#define CAL6                             BANKMASK(RTCCAL), 6
#define CAL61                            BANKMASK(TMR1L), 6
#define CAL7                             BANKMASK(RTCCAL), 7
#define CAL71                            BANKMASK(TMR1L), 7
#define CALC0                            BANKMASK(ADCON3), 4
#define CALC1                            BANKMASK(ADCON3), 5
#define CALC2                            BANKMASK(ADCON3), 6
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE6), 0
#define CCP1IF                           BANKMASK(PIR6), 0
#define CCP1MD                           BANKMASK(PMD3), 0
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OE                           BANKMASK(CCP1CON), 6
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE6), 1
#define CCP2IF                           BANKMASK(PIR6), 1
#define CCP2MD                           BANKMASK(PMD3), 1
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OE                           BANKMASK(CCP2CON), 6
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CCP3MD                           BANKMASK(PMD3), 2
#define CCP4MD                           BANKMASK(PMD3), 3
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CHIME                            BANKMASK(ALRMCON), 6
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CLC1IE                           BANKMASK(PIE5), 4
#define CLC1IF                           BANKMASK(PIR5), 4
#define CLC1MD                           BANKMASK(PMD5), 1
#define CLC2IE                           BANKMASK(PIE5), 5
#define CLC2IF                           BANKMASK(PIR5), 5
#define CLC2MD                           BANKMASK(PMD5), 2
#define CLC3IE                           BANKMASK(PIE5), 6
#define CLC3IF                           BANKMASK(PIR5), 6
#define CLC3MD                           BANKMASK(PMD5), 3
#define CLC4IE                           BANKMASK(PIE5), 7
#define CLC4IF                           BANKMASK(PIR5), 7
#define CLC4MD                           BANKMASK(PMD5), 4
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CMP1MD                           BANKMASK(PMD2), 1
#define CMP2MD                           BANKMASK(PMD2), 2
#define CNT0                             BANKMASK(ADCNT), 0
#define CNT1                             BANKMASK(ADCNT), 1
#define CNT2                             BANKMASK(ADCNT), 2
#define CNT3                             BANKMASK(ADCNT), 3
#define CNT4                             BANKMASK(ADCNT), 4
#define CNT5                             BANKMASK(ADCNT), 5
#define CNT6                             BANKMASK(ADCNT), 6
#define CNT7                             BANKMASK(ADCNT), 7
#define CONT                             BANKMASK(ADCON0), 6
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CPOL                             BANKMASK(SMT1CON0), 2
#define CPR0                             BANKMASK(SMT1CPRL), 0
#define CPR1                             BANKMASK(SMT1CPRL), 1
#define CPR10                            BANKMASK(SMT1CPRH), 2
#define CPR11                            BANKMASK(SMT1CPRH), 3
#define CPR12                            BANKMASK(SMT1CPRH), 4
#define CPR13                            BANKMASK(SMT1CPRH), 5
#define CPR14                            BANKMASK(SMT1CPRH), 6
#define CPR15                            BANKMASK(SMT1CPRH), 7
#define CPR16                            BANKMASK(SMT1CPRU), 0
#define CPR17                            BANKMASK(SMT1CPRU), 1
#define CPR18                            BANKMASK(SMT1CPRU), 2
#define CPR19                            BANKMASK(SMT1CPRU), 3
#define CPR2                             BANKMASK(SMT1CPRL), 2
#define CPR20                            BANKMASK(SMT1CPRU), 4
#define CPR21                            BANKMASK(SMT1CPRU), 5
#define CPR22                            BANKMASK(SMT1CPRU), 6
#define CPR23                            BANKMASK(SMT1CPRU), 7
#define CPR3                             BANKMASK(SMT1CPRL), 3
#define CPR4                             BANKMASK(SMT1CPRL), 4
#define CPR5                             BANKMASK(SMT1CPRL), 5
#define CPR6                             BANKMASK(SMT1CPRL), 6
#define CPR7                             BANKMASK(SMT1CPRL), 7
#define CPR8                             BANKMASK(SMT1CPRH), 0
#define CPR9                             BANKMASK(SMT1CPRH), 1
#define CPRUP                            BANKMASK(SMT1STAT), 7
#define CPW0                             BANKMASK(SMT1CPWL), 0
#define CPW1                             BANKMASK(SMT1CPWL), 1
#define CPW10                            BANKMASK(SMT1CPWH), 2
#define CPW11                            BANKMASK(SMT1CPWH), 3
#define CPW12                            BANKMASK(SMT1CPWH), 4
#define CPW13                            BANKMASK(SMT1CPWH), 5
#define CPW14                            BANKMASK(SMT1CPWH), 6
#define CPW15                            BANKMASK(SMT1CPWH), 7
#define CPW16                            BANKMASK(SMT1CPWU), 0
#define CPW17                            BANKMASK(SMT1CPWU), 1
#define CPW18                            BANKMASK(SMT1CPWU), 2
#define CPW19                            BANKMASK(SMT1CPWU), 3
#define CPW2                             BANKMASK(SMT1CPWL), 2
#define CPW20                            BANKMASK(SMT1CPWU), 4
#define CPW21                            BANKMASK(SMT1CPWU), 5
#define CPW22                            BANKMASK(SMT1CPWU), 6
#define CPW23                            BANKMASK(SMT1CPWU), 7
#define CPW3                             BANKMASK(SMT1CPWL), 3
#define CPW4                             BANKMASK(SMT1CPWL), 4
#define CPW5                             BANKMASK(SMT1CPWL), 5
#define CPW6                             BANKMASK(SMT1CPWL), 6
#define CPW7                             BANKMASK(SMT1CPWL), 7
#define CPW8                             BANKMASK(SMT1CPWH), 0
#define CPW9                             BANKMASK(SMT1CPWH), 1
#define CPWDT                            BANKMASK(LCDVCON2), 7
#define CPWUP                            BANKMASK(SMT1STAT), 6
#define CRIE                             BANKMASK(PIE6), 7
#define CRIF                             BANKMASK(PIR6), 7
#define CRS0                             BANKMASK(ADCON2), 4
#define CRS1                             BANKMASK(ADCON2), 5
#define CRS2                             BANKMASK(ADCON2), 6
#define CS4                              BANKMASK(ADCLK), 4
#define CS5                              BANKMASK(ADCLK), 5
#define CSEL0                            BANKMASK(SMT1CLK), 0
#define CSEL1                            BANKMASK(SMT1CLK), 1
#define CSEL2                            BANKMASK(SMT1CLK), 2
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE1), 6
#define CSWIF                            BANKMASK(PIR1), 6
#define CWG1CS                           BANKMASK(CWG1CLKCON), 0
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IE                           BANKMASK(PIE7), 0
#define CWG1IF                           BANKMASK(PIR7), 0
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1ISM0                         BANKMASK(CWG1ISM), 0
#define CWG1ISM1                         BANKMASK(CWG1ISM), 1
#define CWG1ISM2                         BANKMASK(CWG1ISM), 2
#define CWG1ISM3                         BANKMASK(CWG1ISM), 3
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MD                           BANKMASK(PMD4), 0
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1STR), 4
#define CWG1OVRB                         BANKMASK(CWG1STR), 5
#define CWG1OVRC                         BANKMASK(CWG1STR), 6
#define CWG1OVRD                         BANKMASK(CWG1STR), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1PPS0                         BANKMASK(CWG1PPS), 0
#define CWG1PPS1                         BANKMASK(CWG1PPS), 1
#define CWG1PPS2                         BANKMASK(CWG1PPS), 2
#define CWG1PPS3                         BANKMASK(CWG1PPS), 3
#define CWG1PPS4                         BANKMASK(CWG1PPS), 4
#define CWG1REN                          BANKMASK(CWG1AS0), 6
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7
#define CWG1STRA                         BANKMASK(CWG1STR), 0
#define CWG1STRB                         BANKMASK(CWG1STR), 1
#define CWG1STRC                         BANKMASK(CWG1STR), 2
#define CWG1STRD                         BANKMASK(CWG1STR), 3
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DA                               BANKMASK(SSP1STAT), 5
#define DA1                              BANKMASK(SSP1STAT), 5
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1NSS                          BANKMASK(DAC1CON0), 0
#define DAC1OE1                          BANKMASK(DAC1CON0), 5
#define DAC1OE2                          BANKMASK(DAC1CON0), 4
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3
#define DAC1R0                           BANKMASK(DAC1CON1), 0
#define DAC1R1                           BANKMASK(DAC1CON1), 1
#define DAC1R2                           BANKMASK(DAC1CON1), 2
#define DAC1R3                           BANKMASK(DAC1CON1), 3
#define DAC1R4                           BANKMASK(DAC1CON1), 4
#define DACMD                            BANKMASK(PMD2), 6
#define DATA_ADDRESS                     BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5
#define DAYH0                            BANKMASK(DAY), 4
#define DAYH1                            BANKMASK(DAY), 5
#define DAYL0                            BANKMASK(DAY), 0
#define DAYL1                            BANKMASK(DAY), 1
#define DAYL2                            BANKMASK(DAY), 2
#define DAYL3                            BANKMASK(DAY), 3
#define DBF0                             BANKMASK(CWG1DBF), 0
#define DBF1                             BANKMASK(CWG1DBF), 1
#define DBF2                             BANKMASK(CWG1DBF), 2
#define DBF3                             BANKMASK(CWG1DBF), 3
#define DBF4                             BANKMASK(CWG1DBF), 4
#define DBF5                             BANKMASK(CWG1DBF), 5
#define DBR0                             BANKMASK(CWG1DBR), 0
#define DBR1                             BANKMASK(CWG1DBR), 1
#define DBR2                             BANKMASK(CWG1DBR), 2
#define DBR3                             BANKMASK(CWG1DBR), 3
#define DBR4                             BANKMASK(CWG1DBR), 4
#define DBR5                             BANKMASK(CWG1DBR), 5
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define DOE                              BANKMASK(CPUDOZE), 4
#define DONE                             BANKMASK(ADCON0), 0
#define DOZE0                            BANKMASK(CPUDOZE), 0
#define DOZE1                            BANKMASK(CPUDOZE), 1
#define DOZE2                            BANKMASK(CPUDOZE), 2
#define DOZEN                            BANKMASK(CPUDOZE), 6
#define DSEN                             BANKMASK(ADCON1), 0
#define D_A                              BANKMASK(SSP1STAT), 5
#define D_A1                             BANKMASK(SSP1STAT), 5
#define D_nA                             BANKMASK(SSP1STAT), 5
#define D_nA1                            BANKMASK(SSP1STAT), 5
#define EN5V                             BANKMASK(LCDVCON1), 6
#define ERR0                             BANKMASK(ADERRL), 0
#define ERR1                             BANKMASK(ADERRL), 1
#define ERR10                            BANKMASK(ADERRH), 2
#define ERR11                            BANKMASK(ADERRH), 3
#define ERR12                            BANKMASK(ADERRH), 4
#define ERR13                            BANKMASK(ADERRH), 5
#define ERR14                            BANKMASK(ADERRH), 6
#define ERR15                            BANKMASK(ADERRH), 7
#define ERR2                             BANKMASK(ADERRL), 2
#define ERR3                             BANKMASK(ADERRL), 3
#define ERR4                             BANKMASK(ADERRL), 4
#define ERR5                             BANKMASK(ADERRL), 5
#define ERR6                             BANKMASK(ADERRL), 6
#define ERR7                             BANKMASK(ADERRL), 7
#define ERR8                             BANKMASK(ADERRH), 0
#define ERR9                             BANKMASK(ADERRH), 1
#define EXTOEN                           BANKMASK(OSCEN), 7
#define EXTOR                            BANKMASK(OSCSTAT), 7
#define FLTR0                            BANKMASK(ADFLTRL), 0
#define FLTR1                            BANKMASK(ADFLTRL), 1
#define FLTR10                           BANKMASK(ADFLTRH), 2
#define FLTR11                           BANKMASK(ADFLTRH), 3
#define FLTR12                           BANKMASK(ADFLTRH), 4
#define FLTR13                           BANKMASK(ADFLTRH), 5
#define FLTR14                           BANKMASK(ADFLTRH), 6
#define FLTR15                           BANKMASK(ADFLTRH), 7
#define FLTR2                            BANKMASK(ADFLTRL), 2
#define FLTR3                            BANKMASK(ADFLTRL), 3
#define FLTR4                            BANKMASK(ADFLTRL), 4
#define FLTR5                            BANKMASK(ADFLTRL), 5
#define FLTR6                            BANKMASK(ADFLTRL), 6
#define FLTR7                            BANKMASK(ADFLTRL), 7
#define FLTR8                            BANKMASK(ADFLTRH), 0
#define FLTR9                            BANKMASK(ADFLTRH), 1
#define FM                               BANKMASK(ADCON0), 2
#define FREE                             BANKMASK(NVMCON1), 4
