GopalSaraf/Practicals/PSDL/include/proc/pic16f19185.inc
#define UA1                              BANKMASK(SSP1STAT), 1
#define UART1MD                          BANKMASK(PMD4), 6
#define UART2MD                          BANKMASK(PMD4), 7
#define UTH0                             BANKMASK(ADUTHL), 0
#define UTH1                             BANKMASK(ADUTHL), 1
#define UTH10                            BANKMASK(ADUTHH), 2
#define UTH11                            BANKMASK(ADUTHH), 3
#define UTH12                            BANKMASK(ADUTHH), 4
#define UTH13                            BANKMASK(ADUTHH), 5
#define UTH14                            BANKMASK(ADUTHH), 6
#define UTH15                            BANKMASK(ADUTHH), 7
#define UTH2                             BANKMASK(ADUTHL), 2
#define UTH3                             BANKMASK(ADUTHL), 3
#define UTH4                             BANKMASK(ADUTHL), 4
#define UTH5                             BANKMASK(ADUTHL), 5
#define UTH6                             BANKMASK(ADUTHL), 6
#define UTH7                             BANKMASK(ADUTHL), 7
#define UTH8                             BANKMASK(ADUTHH), 0
#define UTH9                             BANKMASK(ADUTHH), 1
#define UTHR                             BANKMASK(ADSTAT), 6
#define VB0GPR0                          BANKMASK(VB0GPR), 0
#define VB0GPR1                          BANKMASK(VB0GPR), 1
#define VB0GPR2                          BANKMASK(VB0GPR), 2
#define VB0GPR3                          BANKMASK(VB0GPR), 3
#define VB0GPR4                          BANKMASK(VB0GPR), 4
#define VB0GPR5                          BANKMASK(VB0GPR), 5
#define VB0GPR6                          BANKMASK(VB0GPR), 6
#define VB0GPR7                          BANKMASK(VB0GPR), 7
#define VB1GPR0                          BANKMASK(VB1GPR), 0
#define VB1GPR1                          BANKMASK(VB1GPR), 1
#define VB1GPR2                          BANKMASK(VB1GPR), 2
#define VB1GPR3                          BANKMASK(VB1GPR), 3
#define VB1GPR4                          BANKMASK(VB1GPR), 4
#define VB1GPR5                          BANKMASK(VB1GPR), 5
#define VB1GPR6                          BANKMASK(VB1GPR), 6
#define VB1GPR7                          BANKMASK(VB1GPR), 7
#define VB2GPR0                          BANKMASK(VB2GPR), 0
#define VB2GPR1                          BANKMASK(VB2GPR), 1
#define VB2GPR2                          BANKMASK(VB2GPR), 2
#define VB2GPR3                          BANKMASK(VB2GPR), 3
#define VB2GPR4                          BANKMASK(VB2GPR), 4
#define VB2GPR5                          BANKMASK(VB2GPR), 5
#define VB2GPR6                          BANKMASK(VB2GPR), 6
#define VB2GPR7                          BANKMASK(VB2GPR), 7
#define VB3GPR0                          BANKMASK(VB3GPR), 0
#define VB3GPR1                          BANKMASK(VB3GPR), 1
#define VB3GPR2                          BANKMASK(VB3GPR), 2
#define VB3GPR3                          BANKMASK(VB3GPR), 3
#define VB3GPR4                          BANKMASK(VB3GPR), 4
#define VB3GPR5                          BANKMASK(VB3GPR), 5
#define VB3GPR6                          BANKMASK(VB3GPR), 6
#define VB3GPR7                          BANKMASK(VB3GPR), 7
#define VBATBOR                          BANKMASK(PCON1), 0
#define VREGPM                           BANKMASK(VREGCON), 1
#define WA                               BANKMASK(LCDPS), 4
#define WCOL                             BANKMASK(SSP1CON1), 7
#define WCOL1                            BANKMASK(SSP1CON1), 7
#define WDAY0                            BANKMASK(WEEKDAY), 0
#define WDAY1                            BANKMASK(WEEKDAY), 1
#define WDAY2                            BANKMASK(WEEKDAY), 2
#define WDTCS0                           BANKMASK(WDTCON1), 4
#define WDTCS1                           BANKMASK(WDTCON1), 5
#define WDTCS2                           BANKMASK(WDTCON1), 6
#define WDTPS0                           BANKMASK(WDTCON0), 1
#define WDTPS1                           BANKMASK(WDTCON0), 2
#define WDTPS2                           BANKMASK(WDTCON0), 3
#define WDTPS3                           BANKMASK(WDTCON0), 4
#define WDTPS4                           BANKMASK(WDTCON0), 5
#define WDTPSCNT0                        BANKMASK(WDTPSL), 0
#define WDTPSCNT1                        BANKMASK(WDTPSL), 1
#define WDTPSCNT10                       BANKMASK(WDTPSH), 2
#define WDTPSCNT11                       BANKMASK(WDTPSH), 3
#define WDTPSCNT12                       BANKMASK(WDTPSH), 4
#define WDTPSCNT13                       BANKMASK(WDTPSH), 5
#define WDTPSCNT14                       BANKMASK(WDTPSH), 6
#define WDTPSCNT15                       BANKMASK(WDTPSH), 7
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1
#define WDTPSCNT2                        BANKMASK(WDTPSL), 2
#define WDTPSCNT3                        BANKMASK(WDTPSL), 3
#define WDTPSCNT4                        BANKMASK(WDTPSL), 4
#define WDTPSCNT5                        BANKMASK(WDTPSL), 5
#define WDTPSCNT6                        BANKMASK(WDTPSL), 6
#define WDTPSCNT7                        BANKMASK(WDTPSL), 7
#define WDTPSCNT8                        BANKMASK(WDTPSH), 0
#define WDTPSCNT9                        BANKMASK(WDTPSH), 1
#define WDTSEN                           BANKMASK(WDTCON0), 0
#define WDTSTATE                         BANKMASK(WDTTMR), 2
#define WDTTMR0                          BANKMASK(WDTTMR), 3
#define WDTTMR1                          BANKMASK(WDTTMR), 4
#define WDTTMR2                          BANKMASK(WDTTMR), 5
#define WDTTMR3                          BANKMASK(WDTTMR), 6
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2
#define WERR                             BANKMASK(LCDCON), 5
#define WFT                              BANKMASK(LCDPS), 7
#define WINDOW0                          BANKMASK(WDTCON1), 0
#define WINDOW1                          BANKMASK(WDTCON1), 1
#define WINDOW2                          BANKMASK(WDTCON1), 2
#define WPOL                             BANKMASK(SMT1CON0), 4
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUA6                            BANKMASK(WPUA), 6
#define WPUA7                            BANKMASK(WPUA), 7
#define WPUB0                            BANKMASK(WPUB), 0
#define WPUB1                            BANKMASK(WPUB), 1
#define WPUB2                            BANKMASK(WPUB), 2
#define WPUB3                            BANKMASK(WPUB), 3
#define WPUB4                            BANKMASK(WPUB), 4
#define WPUB5                            BANKMASK(WPUB), 5
#define WPUB6                            BANKMASK(WPUB), 6
#define WPUB7                            BANKMASK(WPUB), 7
#define WPUC0                            BANKMASK(WPUC), 0
#define WPUC1                            BANKMASK(WPUC), 1
#define WPUC2                            BANKMASK(WPUC), 2
#define WPUC3                            BANKMASK(WPUC), 3
#define WPUC4                            BANKMASK(WPUC), 4
#define WPUC6                            BANKMASK(WPUC), 6
#define WPUC7                            BANKMASK(WPUC), 7
#define WPUD0                            BANKMASK(WPUD), 0
#define WPUD1                            BANKMASK(WPUD), 1
#define WPUD2                            BANKMASK(WPUD), 2
#define WPUD3                            BANKMASK(WPUD), 3
#define WPUD4                            BANKMASK(WPUD), 4
#define WPUD5                            BANKMASK(WPUD), 5
#define WPUD6                            BANKMASK(WPUD), 6
#define WPUD7                            BANKMASK(WPUD), 7
#define WPUE0                            BANKMASK(WPUE), 0
#define WPUE1                            BANKMASK(WPUE), 1
#define WPUE2                            BANKMASK(WPUE), 2
#define WPUE3                            BANKMASK(WPUE), 3
#define WPUF0                            BANKMASK(WPUF), 0
#define WPUF1                            BANKMASK(WPUF), 1
#define WPUF2                            BANKMASK(WPUF), 2
#define WPUF3                            BANKMASK(WPUF), 3
#define WPUF4                            BANKMASK(WPUF), 4
#define WPUF5                            BANKMASK(WPUF), 5
#define WPUF6                            BANKMASK(WPUF), 6
#define WPUF7                            BANKMASK(WPUF), 7
#define WR                               BANKMASK(NVMCON1), 1
#define WREN                             BANKMASK(NVMCON1), 2
#define WRERR                            BANKMASK(NVMCON1), 3
#define WS                               BANKMASK(SMT1STAT), 1
#define WSEL0                            BANKMASK(SMT1WIN), 0
#define WSEL1                            BANKMASK(SMT1WIN), 1
#define WSEL2                            BANKMASK(SMT1WIN), 2
#define WSEL3                            BANKMASK(SMT1WIN), 3
#define WSEL4                            BANKMASK(SMT1WIN), 4
#define YEARH0                           BANKMASK(YEAR), 4
#define YEARH1                           BANKMASK(YEAR), 5
#define YEARH2                           BANKMASK(YEAR), 6
#define YEARH3                           BANKMASK(YEAR), 7
#define YEARL0                           BANKMASK(YEAR), 0
#define YEARL1                           BANKMASK(YEAR), 1
#define YEARL2                           BANKMASK(YEAR), 2
#define YEARL3                           BANKMASK(YEAR), 3
#define ZCDIE                            BANKMASK(PIE2), 6
#define ZCDIF                            BANKMASK(PIR2), 6
#define ZCDINTN                          BANKMASK(ZCDCON), 0
#define ZCDINTP                          BANKMASK(ZCDCON), 1
#define ZCDMD                            BANKMASK(PMD2), 0
#define ZCDOUT                           BANKMASK(ZCDCON), 5
#define ZCDPOL                           BANKMASK(ZCDCON), 4
#define ZCDSEN                           BANKMASK(ZCDCON), 7
#define ZERO                             BANKMASK(STATUS), 2
#define Z_SHAD                           BANKMASK(STATUS_SHAD), 2
#define nA                               BANKMASK(SSP1STAT), 5
#define nA2                              BANKMASK(SSP1STAT), 5
#define nADDRESS                         BANKMASK(SSP1STAT), 5
#define nADDRESS1                        BANKMASK(SSP1STAT), 5
#define nBOR                             BANKMASK(PCON0), 0
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON0), 1
#define nRI                              BANKMASK(PCON0), 2
#define nRMCLR                           BANKMASK(PCON0), 3
#define nRWDT                            BANKMASK(PCON0), 4
#define nSYNC                            BANKMASK(T1CON), 2
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nW                               BANKMASK(SSP1STAT), 2
#define nW2                              BANKMASK(SSP1STAT), 2
#define nWDTWV                           BANKMASK(PCON0), 5
#define nWRITE                           BANKMASK(SSP1STAT), 2
#define nWRITE1                          BANKMASK(SSP1STAT), 2

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16F19185_INC_
